; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck package - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - package ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action load-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action unload-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action board-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action disembark-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action drive-truck
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location
    ?truck - truck)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action walk
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-4-7-12)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	truck7 - truck
	package1 - package
	package2 - package
	package3 - package
	package4 - package
	package5 - package
	package6 - package
	package7 - package
	package8 - package
	package9 - package
	package10 - package
	package11 - package
	package12 - package
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	s9 - location
	p0-1 - location
	p1-3 - location
	p1-8 - location
	p1-9 - location
	p2-5 - location
	p2-6 - location
	p2-7 - location
	p3-0 - location
	p3-1 - location
	p3-4 - location
	p3-7 - location
	p3-8 - location
	p5-6 - location
	p5-9 - location
	p6-0 - location
	p8-0 - location
	p9-2 - location
	p9-7 - location
	)
	(:init
	(at driver1 s1)
	(at driver2 s1)
	(at driver3 s3)
	(at driver4 s8)
	(at truck1 s6)
	(empty truck1)
	(at truck2 s4)
	(empty truck2)
	(at truck3 s5)
	(empty truck3)
	(at truck4 s8)
	(empty truck4)
	(at truck5 s0)
	(empty truck5)
	(at truck6 s6)
	(empty truck6)
	(at truck7 s4)
	(empty truck7)
	(at package1 s3)
	(at package2 s2)
	(at package3 s8)
	(at package4 s2)
	(at package5 s4)
	(at package6 s9)
	(at package7 s2)
	(at package8 s1)
	(at package9 s8)
	(at package10 s3)
	(at package11 s8)
	(at package12 s1)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(path s1 p1-3)
	(path p1-3 s1)
	(path s3 p1-3)
	(path p1-3 s3)
	(path s1 p1-8)
	(path p1-8 s1)
	(path s8 p1-8)
	(path p1-8 s8)
	(path s1 p1-9)
	(path p1-9 s1)
	(path s9 p1-9)
	(path p1-9 s9)
	(path s2 p2-5)
	(path p2-5 s2)
	(path s5 p2-5)
	(path p2-5 s5)
	(path s2 p2-6)
	(path p2-6 s2)
	(path s6 p2-6)
	(path p2-6 s6)
	(path s2 p2-7)
	(path p2-7 s2)
	(path s7 p2-7)
	(path p2-7 s7)
	(path s3 p3-0)
	(path p3-0 s3)
	(path s0 p3-0)
	(path p3-0 s0)
	(path s3 p3-4)
	(path p3-4 s3)
	(path s4 p3-4)
	(path p3-4 s4)
	(path s3 p3-7)
	(path p3-7 s3)
	(path s7 p3-7)
	(path p3-7 s7)
	(path s3 p3-8)
	(path p3-8 s3)
	(path s8 p3-8)
	(path p3-8 s8)
	(path s5 p5-6)
	(path p5-6 s5)
	(path s6 p5-6)
	(path p5-6 s6)
	(path s5 p5-9)
	(path p5-9 s5)
	(path s9 p5-9)
	(path p5-9 s9)
	(path s6 p6-0)
	(path p6-0 s6)
	(path s0 p6-0)
	(path p6-0 s0)
	(path s8 p8-0)
	(path p8-0 s8)
	(path s0 p8-0)
	(path p8-0 s0)
	(path s9 p9-2)
	(path p9-2 s9)
	(path s2 p9-2)
	(path p9-2 s2)
	(path s9 p9-7)
	(path p9-7 s9)
	(path s7 p9-7)
	(path p9-7 s7)
	(link s0 s4)
	(link s4 s0)
	(link s0 s9)
	(link s9 s0)
	(link s1 s0)
	(link s0 s1)
	(link s2 s3)
	(link s3 s2)
	(link s2 s5)
	(link s5 s2)
	(link s2 s8)
	(link s8 s2)
	(link s3 s9)
	(link s9 s3)
	(link s4 s1)
	(link s1 s4)
	(link s4 s5)
	(link s5 s4)
	(link s4 s6)
	(link s6 s4)
	(link s4 s7)
	(link s7 s4)
	(link s5 s1)
	(link s1 s5)
	(link s5 s6)
	(link s6 s5)
	(link s5 s7)
	(link s7 s5)
	(link s6 s8)
	(link s8 s6)
	(link s7 s2)
	(link s2 s7)
	(link s7 s3)
	(link s3 s7)
	(link s7 s6)
	(link s6 s7)
	(link s8 s0)
	(link s0 s8)
	(link s8 s3)
	(link s3 s8)
	(link s8 s4)
	(link s4 s8)
	(link s8 s7)
	(link s7 s8)
	(link s9 s6)
	(link s6 s9)
	(link s9 s7)
	(link s7 s9)
	(link s9 s8)
	(link s8 s9)
)
	(:goal (and
	(at driver1 s1)
	(at driver2 s7)
	(at driver3 s0)
	(at driver4 s7)
	(at truck2 s6)
	(at truck4 s3)
	(at truck5 s6)
	(at truck6 s5)
	(at truck7 s7)
	(at package1 s8)
	(at package2 s1)
	(at package3 s0)
	(at package4 s6)
	(at package5 s1)
	(at package6 s6)
	(at package7 s4)
	(at package8 s4)
	(at package9 s1)
	(at package10 s5)
	(at package11 s9)
	(at package12 s1)
	))


)

; plan
1. (board-truck driver4 s8 truck4)
   deleted: (at driver4 s8) (empty truck4)
   added: (driving driver4 truck4)
   goals met: 2 of 21
2. (load-truck s8 package9 truck4)
   deleted: (at package9 s8)
   added: (in package9 truck4)
   goals met: 2 of 21
3. (load-truck s8 package3 truck4)
   deleted: (at package3 s8)
   added: (in package3 truck4)
   goals met: 2 of 21
4. (load-truck s8 package11 truck4)
   deleted: (at package11 s8)
   added: (in package11 truck4)
   goals met: 2 of 21
5. (walk driver2 s1 p1-9)
   deleted: (at driver2 s1)
   added: (at driver2 p1-9)
   goals met: 2 of 21
6. (walk driver2 p1-9 s9)
   deleted: (at driver2 p1-9)
   added: (at driver2 s9)
   goals met: 2 of 21
7. (walk driver2 s9 p9-7)
   deleted: (at driver2 s9)
   added: (at driver2 p9-7)
   goals met: 2 of 21
8. (walk driver2 p9-7 s7)
   deleted: (at driver2 p9-7)
   added: (at driver2 s7)
   goals met: 3 of 21
9. (walk driver3 s3 p3-0)
   deleted: (at driver3 s3)
   added: (at driver3 p3-0)
   goals met: 3 of 21
10. (walk driver3 p3-0 s0)
   deleted: (at driver3 p3-0)
   added: (at driver3 s0)
   goals met: 4 of 21
11. (board-truck driver3 s0 truck5)
   deleted: (at driver3 s0) (empty truck5)
   added: (driving driver3 truck5)
   goals met: 3 of 21
12. (drive-truck driver4 s8 s2 truck4)
   deleted: (at truck4 s8)
   added: (at truck4 s2)
   goals met: 3 of 21
13. (load-truck s2 package7 truck4)
   deleted: (at package7 s2)
   added: (in package7 truck4)
   goals met: 3 of 21
14. (drive-truck driver4 s2 s3 truck4)
   deleted: (at truck4 s2)
   added: (at truck4 s3)
   goals met: 4 of 21
15. (drive-truck driver4 s3 s7 truck4)
   deleted: (at truck4 s3)
   added: (at truck4 s7)
   goals met: 3 of 21
16. (drive-truck driver3 s0 s1 truck5)
   deleted: (at truck5 s0)
   added: (at truck5 s1)
   goals met: 3 of 21
17. (load-truck s1 package8 truck5)
   deleted: (at package8 s1)
   added: (in package8 truck5)
   goals met: 3 of 21
18. (drive-truck driver3 s1 s0 truck5)
   deleted: (at truck5 s1)
   added: (at truck5 s0)
   goals met: 3 of 21
19. (drive-truck driver3 s0 s4 truck5)
   deleted: (at truck5 s0)
   added: (at truck5 s4)
   goals met: 3 of 21
20. (unload-truck s4 package8 truck5)
   deleted: (in package8 truck5)
   added: (at package8 s4)
   goals met: 4 of 21
21. (load-truck s4 package5 truck5)
   deleted: (at package5 s4)
   added: (in package5 truck5)
   goals met: 4 of 21
22. (drive-truck driver4 s7 s3 truck4)
   deleted: (at truck4 s7)
   added: (at truck4 s3)
   goals met: 5 of 21
23. (load-truck s3 package10 truck4)
   deleted: (at package10 s3)
   added: (in package10 truck4)
   goals met: 5 of 21
24. (load-truck s3 package1 truck4)
   deleted: (at package1 s3)
   added: (in package1 truck4)
   goals met: 5 of 21
25. (drive-truck driver4 s3 s2 truck4)
   deleted: (at truck4 s3)
   added: (at truck4 s2)
   goals met: 4 of 21
26. (drive-truck driver4 s2 s7 truck4)
   deleted: (at truck4 s2)
   added: (at truck4 s7)
   goals met: 4 of 21
27. (drive-truck driver4 s7 s8 truck4)
   deleted: (at truck4 s7)
   added: (at truck4 s8)
   goals met: 4 of 21
28. (unload-truck s8 package1 truck4)
   deleted: (in package1 truck4)
   added: (at package1 s8)
   goals met: 5 of 21
29. (drive-truck driver4 s8 s2 truck4)
   deleted: (at truck4 s8)
   added: (at truck4 s2)
   goals met: 5 of 21
30. (load-truck s2 package4 truck4)
   deleted: (at package4 s2)
   added: (in package4 truck4)
   goals met: 5 of 21
31. (drive-truck driver4 s2 s5 truck4)
   deleted: (at truck4 s2)
   added: (at truck4 s5)
   goals met: 5 of 21
32. (drive-truck driver4 s5 s6 truck4)
   deleted: (at truck4 s5)
   added: (at truck4 s6)
   goals met: 5 of 21
33. (unload-truck s6 package4 truck4)
   deleted: (in package4 truck4)
   added: (at package4 s6)
   goals met: 6 of 21
34. (drive-truck driver4 s6 s7 truck4)
   deleted: (at truck4 s6)
   added: (at truck4 s7)
   goals met: 6 of 21
35. (drive-truck driver4 s7 s9 truck4)
   deleted: (at truck4 s7)
   added: (at truck4 s9)
   goals met: 6 of 21
36. (load-truck s9 package6 truck4)
   deleted: (at package6 s9)
   added: (in package6 truck4)
   goals met: 6 of 21
37. (drive-truck driver4 s9 s6 truck4)
   deleted: (at truck4 s9)
   added: (at truck4 s6)
   goals met: 6 of 21
38. (unload-truck s6 package6 truck4)
   deleted: (in package6 truck4)
   added: (at package6 s6)
   goals met: 7 of 21
39. (drive-truck driver4 s6 s4 truck4)
   deleted: (at truck4 s6)
   added: (at truck4 s4)
   goals met: 7 of 21
40. (unload-truck s4 package7 truck4)
   deleted: (in package7 truck4)
   added: (at package7 s4)
   goals met: 8 of 21
41. (drive-truck driver4 s4 s5 truck4)
   deleted: (at truck4 s4)
   added: (at truck4 s5)
   goals met: 8 of 21
42. (unload-truck s5 package10 truck4)
   deleted: (in package10 truck4)
   added: (at package10 s5)
   goals met: 9 of 21
43. (drive-truck driver4 s5 s2 truck4)
   deleted: (at truck4 s5)
   added: (at truck4 s2)
   goals met: 9 of 21
44. (drive-truck driver4 s2 s7 truck4)
   deleted: (at truck4 s2)
   added: (at truck4 s7)
   goals met: 9 of 21
45. (drive-truck driver4 s7 s9 truck4)
   deleted: (at truck4 s7)
   added: (at truck4 s9)
   goals met: 9 of 21
46. (unload-truck s9 package11 truck4)
   deleted: (in package11 truck4)
   added: (at package11 s9)
   goals met: 10 of 21
47. (drive-truck driver4 s9 s7 truck4)
   deleted: (at truck4 s9)
   added: (at truck4 s7)
   goals met: 10 of 21
48. (drive-truck driver4 s7 s2 truck4)
   deleted: (at truck4 s7)
   added: (at truck4 s2)
   goals met: 10 of 21
49. (load-truck s2 package2 truck4)
   deleted: (at package2 s2)
   added: (in package2 truck4)
   goals met: 10 of 21
50. (drive-truck driver4 s2 s5 truck4)
   deleted: (at truck4 s2)
   added: (at truck4 s5)
   goals met: 10 of 21
51. (drive-truck driver4 s5 s1 truck4)
   deleted: (at truck4 s5)
   added: (at truck4 s1)
   goals met: 10 of 21
52. (unload-truck s1 package9 truck4)
   deleted: (in package9 truck4)
   added: (at package9 s1)
   goals met: 11 of 21
53. (drive-truck driver4 s1 s0 truck4)
   deleted: (at truck4 s1)
   added: (at truck4 s0)
   goals met: 11 of 21
54. (unload-truck s0 package3 truck4)
   deleted: (in package3 truck4)
   added: (at package3 s0)
   goals met: 12 of 21
55. (drive-truck driver4 s0 s1 truck4)
   deleted: (at truck4 s0)
   added: (at truck4 s1)
   goals met: 12 of 21
56. (unload-truck s1 package2 truck4)
   deleted: (in package2 truck4)
   added: (at package2 s1)
   goals met: 13 of 21
57. (drive-truck driver4 s1 s0 truck4)
   deleted: (at truck4 s1)
   added: (at truck4 s0)
   goals met: 13 of 21
58. (drive-truck driver4 s0 s9 truck4)
   deleted: (at truck4 s0)
   added: (at truck4 s9)
   goals met: 13 of 21
59. (drive-truck driver4 s9 s3 truck4)
   deleted: (at truck4 s9)
   added: (at truck4 s3)
   goals met: 14 of 21
60. (drive-truck driver4 s3 s7 truck4)
   deleted: (at truck4 s3)
   added: (at truck4 s7)
   goals met: 13 of 21
61. (drive-truck driver3 s4 s1 truck5)
   deleted: (at truck5 s4)
   added: (at truck5 s1)
   goals met: 13 of 21
62. (unload-truck s1 package5 truck5)
   deleted: (in package5 truck5)
   added: (at package5 s1)
   goals met: 14 of 21
63. (drive-truck driver3 s1 s0 truck5)
   deleted: (at truck5 s1)
   added: (at truck5 s0)
   goals met: 14 of 21
64. (drive-truck driver3 s0 s9 truck5)
   deleted: (at truck5 s0)
   added: (at truck5 s9)
   goals met: 14 of 21
65. (drive-truck driver3 s9 s6 truck5)
   deleted: (at truck5 s9)
   added: (at truck5 s6)
   goals met: 15 of 21
66. (disembark-truck driver3 s6 truck5)
   deleted: (driving driver3 truck5)
   added: (at driver3 s6) (empty truck5)
   goals met: 15 of 21
67. (drive-truck driver4 s7 s3 truck4)
   deleted: (at truck4 s7)
   added: (at truck4 s3)
   goals met: 16 of 21
68. (disembark-truck driver4 s3 truck4)
   deleted: (driving driver4 truck4)
   added: (at driver4 s3) (empty truck4)
   goals met: 16 of 21
69. (walk driver4 s3 p3-4)
   deleted: (at driver4 s3)
   added: (at driver4 p3-4)
   goals met: 16 of 21
70. (walk driver4 p3-4 s4)
   deleted: (at driver4 p3-4)
   added: (at driver4 s4)
   goals met: 16 of 21
71. (board-truck driver4 s4 truck7)
   deleted: (at driver4 s4) (empty truck7)
   added: (driving driver4 truck7)
   goals met: 16 of 21
72. (drive-truck driver4 s4 s7 truck7)
   deleted: (at truck7 s4)
   added: (at truck7 s7)
   goals met: 17 of 21
73. (disembark-truck driver4 s7 truck7)
   deleted: (driving driver4 truck7)
   added: (at driver4 s7) (empty truck7)
   goals met: 18 of 21
74. (board-truck driver3 s6 truck1)
   deleted: (at driver3 s6) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 18 of 21
75. (drive-truck driver3 s6 s4 truck1)
   deleted: (at truck1 s6)
   added: (at truck1 s4)
   goals met: 18 of 21
76. (drive-truck driver3 s4 s0 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s0)
   goals met: 18 of 21
77. (disembark-truck driver3 s0 truck1)
   deleted: (driving driver3 truck1)
   added: (at driver3 s0) (empty truck1)
   goals met: 19 of 21
78. (walk driver3 s0 p6-0)
   deleted: (at driver3 s0)
   added: (at driver3 p6-0)
   goals met: 18 of 21
79. (board-truck driver4 s7 truck7)
   deleted: (at driver4 s7) (empty truck7)
   added: (driving driver4 truck7)
   goals met: 17 of 21
80. (walk driver3 p6-0 s6)
   deleted: (at driver3 p6-0)
   added: (at driver3 s6)
   goals met: 17 of 21
81. (board-truck driver3 s6 truck6)
   deleted: (at driver3 s6) (empty truck6)
   added: (driving driver3 truck6)
   goals met: 17 of 21
82. (drive-truck driver3 s6 s4 truck6)
   deleted: (at truck6 s6)
   added: (at truck6 s4)
   goals met: 17 of 21
83. (disembark-truck driver4 s7 truck7)
   deleted: (driving driver4 truck7)
   added: (at driver4 s7) (empty truck7)
   goals met: 18 of 21
84. (drive-truck driver3 s4 s0 truck6)
   deleted: (at truck6 s4)
   added: (at truck6 s0)
   goals met: 18 of 21
85. (disembark-truck driver3 s0 truck6)
   deleted: (driving driver3 truck6)
   added: (at driver3 s0) (empty truck6)
   goals met: 19 of 21
86. (board-truck driver3 s0 truck1)
   deleted: (at driver3 s0) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 18 of 21
87. (drive-truck driver3 s0 s4 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s4)
   goals met: 18 of 21
88. (walk driver1 s1 p0-1)
   deleted: (at driver1 s1)
   added: (at driver1 p0-1)
   goals met: 17 of 21
89. (walk driver1 p0-1 s0)
   deleted: (at driver1 p0-1)
   added: (at driver1 s0)
   goals met: 17 of 21
90. (board-truck driver1 s0 truck6)
   deleted: (at driver1 s0) (empty truck6)
   added: (driving driver1 truck6)
   goals met: 17 of 21
91. (drive-truck driver1 s0 s1 truck6)
   deleted: (at truck6 s0)
   added: (at truck6 s1)
   goals met: 17 of 21
92. (disembark-truck driver3 s4 truck1)
   deleted: (driving driver3 truck1)
   added: (at driver3 s4) (empty truck1)
   goals met: 17 of 21
93. (board-truck driver3 s4 truck2)
   deleted: (at driver3 s4) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 17 of 21
94. (drive-truck driver3 s4 s6 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s6)
   goals met: 18 of 21
95. (disembark-truck driver3 s6 truck2)
   deleted: (driving driver3 truck2)
   added: (at driver3 s6) (empty truck2)
   goals met: 18 of 21
96. (walk driver3 s6 p6-0)
   deleted: (at driver3 s6)
   added: (at driver3 p6-0)
   goals met: 18 of 21
97. (walk driver3 p6-0 s0)
   deleted: (at driver3 p6-0)
   added: (at driver3 s0)
   goals met: 19 of 21
98. (drive-truck driver1 s1 s5 truck6)
   deleted: (at truck6 s1)
   added: (at truck6 s5)
   goals met: 20 of 21
99. (disembark-truck driver1 s5 truck6)
   deleted: (driving driver1 truck6)
   added: (at driver1 s5) (empty truck6)
   goals met: 20 of 21
100. (board-truck driver1 s5 truck3)
   deleted: (at driver1 s5) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 20 of 21
101. (drive-truck driver1 s5 s1 truck3)
   deleted: (at truck3 s5)
   added: (at truck3 s1)
   goals met: 20 of 21
102. (disembark-truck driver1 s1 truck3)
   deleted: (driving driver1 truck3)
   added: (at driver1 s1) (empty truck3)
   goals met: 21 of 21
